app/controllers/api/follows_controller.rb

    def create
        @follow = Follow.new
        @follow.user_id = current_user.id
        @follow.show_id = params[:id]

        if @follow.save
---
INSERT INTO "follows" ("user_id", "show_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["show_id", 32], ["created_at", "2020-08-14 07:00:46.909212"], ["updated_at", "2020-08-14 07:00:46.909212"]]

    def destroy
        @follow = Follow.find(params[:id])
        @follow.destroy
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 17]]