app/controllers/api/friends_controller.rb

    def create
        @friend = Friend.new
        @friend.user_id = current_user.id
        @friend.friend_id = params[:id]

        if @friend.save
---
INSERT INTO "friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 28], ["created_at", "2020-09-28 15:40:32.204459"], ["updated_at", "2020-09-28 15:40:32.204459"]]