app/controllers/api/movies_controller.rb

    def create
        @movie = Movie.new(movie_params)

        if @movie.save
---
INSERT INTO "movies" ("title", "run_time", "desc", "created_at", "updated_at", "genre") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "jhbwbhber"], ["run_time", "12:00:00"], ["desc", "erf"], ["created_at", "2020-09-01 18:22:45.582901"], ["updated_at", "2020-09-01 18:22:45.582901"], ["genre", "Action"]]