app/controllers/api/shows_controller.rb

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 386], ["LIMIT", 1]]
---
    def show
        @show = Show.find(params[:id])