app/controllers/api/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE (lat < '37.835348325593905') AND (lat > '37.76753010704273') AND (lng > '-122.30660034423828') AND (lng < '-122.22076965576171')
SELECT "shows".* FROM "shows" WHERE (lat < '37.835348325593905') AND (lat > '37.76753010704273') AND (lng > '-122.30660034423828') AND (lng < '-122.22076965576171') AND "shows"."date" BETWEEN $1 AND $2  [["date", nil], ["date", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN ($1, $2)  [["id", 1], ["id", 3]]
SELECT "shows".* FROM "shows" WHERE (lat < '38.67538477667136') AND (lat > '36.49921069434005') AND (lng > '-123.53047775505591') AND (lng < '-121.79463791130591') AND "shows"."date" = $1  [["date", "2020-09-28"]]
---
    def index
        shows = bounds ? Show.in_bounds(bounds) : Show.all

        shows = shows.where(date: date)

        @shows = shows.includes(:movie)

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @show = Show.find(params[:id])

INSERT INTO "shows" ("movie_id", "date", "created_at", "updated_at", "lat", "lng", "desc", "time", "address") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @show = Show.new(show_params)

        if @show.save