app/controllers/api/users_controller.rb

    def index

        if user_email != ""
            users = User.all
            @users = users.where(id: current_user)
                .or(users.where('email LIKE ?', "%#{user_email}%"))
                .order("case when id = #{current_user.id} then 1 else 2 end").limit(10)
        else
            @users = User.where(id: current_user)
---
SELECT  "users".* FROM "users" WHERE ("users"."id" = $1 OR (email LIKE '%a%')) ORDER BY case when id = #<User:0x00007fc88d2a0d48> then 1 else 2 end LIMIT $2  [["id", 1], ["LIMIT", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]