app/views/api/users/_user.json.jbuilder

SELECT "shows".* FROM "shows" INNER JOIN "follows" ON "shows"."id" = "follows"."show_id" WHERE "follows"."user_id" = $1  [["user_id", 1]]
---
json.shows do
    user.shows.each do |show|